app/views/tweets/_form.html.erb

SELECT "users".* FROM "users"
---
      <option></option>
      <% User.all.each do |user| %>