app/controllers/tweets_controller.rb

  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "fgj"], ["created_at", "2017-04-05 21:32:18.825459"], ["updated_at", "2017-04-05 21:32:18.825459"], ["user_id", 8]]